StephenbDennis/room_tracker/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# --- Bluetooth: NimBLE only (the S3 has no classic BT) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# Large MTU keeps config chunking cheap and lets a full track frame ride in
# a single notification.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=8

# --- WiFi / ESP-NOW ---
# WiFi is initialised but never associated; ESP-NOW rides on a fixed channel.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16

# --- BLE / WiFi coexistence ---
# Both share one radio on the S3. Software coexistence is required or the
# 10 Hz notify stream and the ESP-NOW broadcasts will starve each other.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# --- UART ---
# 256000 baud from the LD2450; the default REF_TICK source cannot divide to it
# accurately, so leave the clock on APB.
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- misc ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
